#	Что такое функция?
'''
Функция - это область внутри программы(кода), в которую помещается некоторый код,
для дальнейшего его использования без повторного его написания
'''

#	Цели и задачи функции.
'''
Функции нужны для того, чтобы не повторять какую-то часть кода
по несколько раз, чтобы не заполнить ОЗУ и не делать ваш код сложно-читаемым
'''

#	Встроенные функции.
'''
max()
min()
len()
reversed()
sorted()
int() 
float()
str()
bool()
print()
len()

sum()
eval() - преобразовывает строчное выражение в математическое и выдает значение,
 которое является результатом какой-либо матем-ой операции
pow()
ord() - переводил в его десятичное представление по аски
oct() - 8
bin() - 2
hex() - 16
abs() - модуль
fabs() - int module

map()
filter()
zip()
reduce()
'''

#	Математические функции и случайные числа.
'''
import math
import random
'''

#Синтаксис объявления функций.
'''
def имя_функүии(параметры):
    инструция
 '''


#Аргументы и возвращаемые значения
'''
Виды функций:
1)ничего не принимает ничего не возвращает
2) при входе принимает но ничего не возвращает
3) ничего не принимает но возвращает
4)принимает и возвращает
'''


#___________________________________________________________________
#Practise
'''
1.Напишите функцию, которая принимает два числа в качестве параметра и отображает все нечетные числа между ними.
2.Напишите функцию, которая отображает горизонтальную или вертикальную линию из некоторого символа.
 Функция принимает в качестве параметров: длину линии, направление, символ. 
3. Напишите функцию, которая возвращает максимальное из четырёх чисел. 
 Числа передаются в качестве параметров.  
4. Напишите функцию, которая возвращает сумму чисел в указанном диапазоне. Границы диапазона передаются в качестве параметров.
'''