#Тип и значения.
'''
int - integer(целые числа) (1,11,123,12412...)

float - floating (числа с плавующей запятой)( 2.5, 3.14, 123.9231 .....)

str - string(строка) ('Hello', 'Your name' ....)

bool - boolean( это логический тип данных он имеет два значения :
    True(имеет целочисленное представление = 1) и False(имеет целочисленное представление = 0))

complex - complexity(комплексные числа)
'''

#Переменные.Имена переменных и зарезервированные слова.
'''
Переменная - именованная область памяти, хранящая какое-либо значение. 
Хранится в оперативной памяти.
Объевление переменной - это все равно что создать ее и задать ей название
Инициализация переменной - это присваивание переменной какое-либо значение
'''
number = 10
Number = 5.2
User_Data = 20
teacher1 = True
_NameStudent = 'Yashar'


#Операторы и операнды.


#Приоритеты операторов.
'''
1.(выражения...) - Круглые скобки

2. ** Возведение в степень. Справа налево

3. +x, -x  Унарные плюс и минус

4. *, /, //, %  Умножение, деление, целочисленное деление, взятие остатка от деления. Слева направо

5. +, -  Сложение и вычитание
'''

#Операции над переменными.


#Ввод/вывод.


#Преобразование типов.


